In [1]:
import pandas

# Working with one stock's data

#### Notes:

The **pandas** *read_csv* function will read a csv file into a DataFrame. If the csv file has a header row, there is no need to pass a value for the *header* argument. In this case, the file has no header row, so we need to tell the function not to take the first row of values as column headers.

In [2]:
aapl = pandas.read_csv('../stock_csvs/table_aapl.csv', header=None)

#### Notes:
    
The *head* method shows us by default the first five rows of the DataFrame across all columns. Passing an integer to *head* will show that number of rows.

In [3]:
aapl.head()

          0  1        2        3        4        5            6
0  19980102  0  3.31397  3.95098  3.28236  3.95098  24947201.10
1  19980105  0  4.01177  4.02635  3.69325  3.89020  22344145.08
2  19980106  0  3.87561  4.98432  3.58628  4.60502  63150252.55
3  19980107  0  4.57341  4.68040  4.20871  4.24032  36978255.52
4  19980108  0  4.24032  4.52965  4.11875  4.39107  27687622.95

#### Notes:

We can set column names by passing a list of names to the *columns* attribute. The number of names here must be equal to the number of columns in the DataFrame.

In [4]:
aapl.columns = ['date', 'time', 'open', 'high', 'low', 'close', 'volume']

In [5]:
aapl.head()

       date  time     open     high      low    close       volume
0  19980102     0  3.31397  3.95098  3.28236  3.95098  24947201.10
1  19980105     0  4.01177  4.02635  3.69325  3.89020  22344145.08
2  19980106     0  3.87561  4.98432  3.58628  4.60502  63150252.55
3  19980107     0  4.57341  4.68040  4.20871  4.24032  36978255.52
4  19980108     0  4.24032  4.52965  4.11875  4.39107  27687622.95

#### Notes: 

a DataFrame's index is used for a number of things, including:

- retrieving particular rows of a DataFrame
- joining DataFrames together

By default, a DataFrame will be given an incremental integer index that starts at 0. You can easily set the index to the vaules of one (or more) of the DataFrame's columns with the *set_index* method. User can select whether to remove the column after passing as an index via the *drop* argument. 

A lot of DataFrame methods will return a new DataFrame. User can select for this to happen to the existing DataFrame instead by passing True to the *inplace* argument when it is avalable. Note that this does not actually guarantee a more efficient process from a memory standpoint. It is more a matter of preference or code style.

In [6]:
aapl.set_index('date', drop=True, inplace=True)

In [7]:
aapl.head()

          time     open     high      low    close       volume
date
19980102     0  3.31397  3.95098  3.28236  3.95098  24947201.10
19980105     0  4.01177  4.02635  3.69325  3.89020  22344145.08
19980106     0  3.87561  4.98432  3.58628  4.60502  63150252.55
19980107     0  4.57341  4.68040  4.20871  4.24032  36978255.52
19980108     0  4.24032  4.52965  4.11875  4.39107  27687622.95

In [8]:
aapl.time.sum()

0

In [9]:
aapl.time.value_counts()

0    3926
Name: time, dtype: int64

*0* is the value

*3926* is the number of rows with that value

'Name' is column name

dtype tells you the type of data, in this case it's an integer 64 bit

In [11]:
len(aapl)

3926

In [12]:
aapl.shape #returns the number of rows/columns

(3926, 6)

#### Notes:
    
You can drop columns from a DataFrame using the *drop* method. In this case, our time column is not useful, so we will drop it. Passisng *axis=1* is necessary so that the function knows to search column labels, and not row labels, for the value 'time'. (*drop* can also be used to remove rows, and the function sets a default value of 0 for *axis*)

In [9]:
aapl.drop('time', axis=1, inplace=True)

In [10]:
aapl.head()

             open     high      low    close       volume
date
19980102  3.31397  3.95098  3.28236  3.95098  24947201.10
19980105  4.01177  4.02635  3.69325  3.89020  22344145.08
19980106  3.87561  4.98432  3.58628  4.60502  63150252.55
19980107  4.57341  4.68040  4.20871  4.24032  36978255.52
19980108  4.24032  4.52965  4.11875  4.39107  27687622.95

#### Notes:
    
DataFrames include a number of methods for describing their data. 

The function *max* returns the maximum for each column in the DataFrame. The function *describe* returns a count of non-null rows, as well as the mean, standard deviation, min, quartiles and max for each column of the DataFrame.

In [11]:
aapl.max()

open      6.858080e+02
high      6.886600e+02
low       6.832870e+02
close     6.856620e+02
volume    2.339738e+08
dtype: float64

In [12]:
aapl.describe()

              open         high          low        close        volume
count  3926.000000  3926.000000  3926.000000  3926.000000  3.926000e+03
mean    131.046735   132.547087   129.276820   130.936396  1.996621e+07
std     165.720993   167.175882   163.849101   165.519449  1.395386e+07
min       3.313970     3.950980     3.282360     3.890200  1.437792e+06
25%      10.879200    11.127125    10.645725    10.892600  1.067201e+07
50%      52.551700    53.052600    51.491650    52.308600  1.581984e+07
75%     184.108000   185.625500   180.998750   184.118500  2.529142e+07
max     685.808000   688.660000   683.287000   685.662000  2.339738e+08

#### Notes:
    
Many DataFrame frame methods also work for the Series (DataFrame column).

In [13]:
aapl['close'].max()

685.66199999999992

In [14]:
aapl['close'].describe()

count    3926.000000
mean      130.936396
std       165.519449
min         3.890200
25%        10.892600
50%        52.308600
75%       184.118500
max       685.662000
Name: close, dtype: float64

#### Notes:

The simplest way to call a DataFrame's column is, if we have an example DataFrame named 'df', with a column 'col':

    df['col']

A DataFrame df's column col can also be called by:
    
    df.col

Additionally, you can use the bracket syntax to create new columns:
    
    df['new_col'] = some_values

You can access more than one column at a time by using double brackets:

    df[['col1', 'col2']]

In [15]:
open_close_avg = aapl[['open', 'close']].mean(axis=1)

In [16]:
open_close_avg.head()

date
19980102    3.632475
19980105    3.950985
19980106    4.240315
19980107    4.406865
19980108    4.315695
dtype: float64

#### Notes:
    
Let's add a daily return column to our aapl DataFrame. 

First we'll need the difference from one day to the next, which we'll calculate using the *shift* method. 

Next we'll divide this difference by the previous day's closing price.

In [ ]:
aapl.close.head()

In [ ]:
aapl.close.shift(1).head()

In [ ]:
aapl.loc[19980102, "close"]

In [ ]:
aapl.loc[19980105, "close"]

In [ ]:
aapl.loc[19980105, "close"] - aapl.loc[19980102, "close"]

In [ ]:
aapl.loc[19980105, "close"] - aapl.shift(1).loc[19980105, "close"]

`shift(n)`, as a method, is a fucntion of the DataFrame that pushes forward in the index every value within a given column by `n` . Whish has the effect of skipping back by `n`. This is very useful for time series analysis, day over percent change.

`shift(n)`,it returns a new column of data containing the data from the column that was called on, pushed forward in the index by `n`. if `n` is negative then you would push backwards in the index by `-n`.

In [17]:
aapl['delta'] = aapl['close'] - aapl['close'].shift(1)

In [18]:
aapl['return'] = aapl['delta'] / aapl['close'].shift(1)

In [19]:
aapl.head()

             open     high      low    close       volume    delta    return
date
19980102  3.31397  3.95098  3.28236  3.95098  24947201.10      NaN       NaN
19980105  4.01177  4.02635  3.69325  3.89020  22344145.08 -0.06078 -0.015384
19980106  3.87561  4.98432  3.58628  4.60502  63150252.55  0.71482  0.183749
19980107  4.57341  4.68040  4.20871  4.24032  36978255.52 -0.36470 -0.079196
19980108  4.24032  4.52965  4.11875  4.39107  27687622.95  0.15075  0.035552

In [20]:
aapl.drop('delta', axis=1, inplace=True)

In [21]:
aapl.head()

             open     high      low    close       volume    return
date
19980102  3.31397  3.95098  3.28236  3.95098  24947201.10       NaN
19980105  4.01177  4.02635  3.69325  3.89020  22344145.08 -0.015384
19980106  3.87561  4.98432  3.58628  4.60502  63150252.55  0.183749
19980107  4.57341  4.68040  4.20871  4.24032  36978255.52 -0.079196
19980108  4.24032  4.52965  4.11875  4.39107  27687622.95  0.035552

#### Notes:
    
Writing a DataFrame to a .csv file is as simple as calling the *to_csv* method and passing a file path.

In [22]:
aapl.to_csv('../output/aapl_new.csv')